app/validators/capacity_validator.rb

SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def validate(record)
    if !record.cargo.nil? && record.cargo > Ship.find(record.ship_id).max_cargo
      record.errors[:base] << "Voyage could not be taken. Ship loaded with too much cargo."
    end
    if !record.distance.nil? && record.distance > Ship.find(record.ship_id).max_distance