app/validators/league_validator.rb

  def validate(record)
    league = League.find(record.league_id)
    if league.full? && !league.fleets.include?(record)
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "fleets" WHERE "fleets"."league_id" = ? AND "fleets"."id" = ? LIMIT ?  [["league_id", 1], ["id", 1], ["LIMIT", 1]]