app/views/voyages/most_recent.html.erb

SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
      <li> Distance: <%= v.distance %> miles </li>
      <li> Ship: <%= Ship.find(v.ship_id).name %> </li>
      <li> Fleet: <%= Fleet.find(v.fleet_id).name %> </li>