app/helpers/fleets_helper.rb

  def set_fleet
    @fleet = Fleet.find(params[:id])
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]