app/helpers/leagues_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def admin(league)
    User.find(league.admin_id)