app/helpers/ships_helper.rb

  def set_fleet
    if params[:fleet_id] && Fleet.exists?(params[:fleet_id])
      @fleet = Fleet.find_by(id: params[:fleet_id])
---
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_ship
    if params[:id] && Ship.exists?(params[:id])
      @ship = Ship.find_by(id: params[:id])
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]