app/helpers/voyages_helper.rb

  def voyage_set_ship
    if params[:ship_id] && Ship.exists?(params[:ship_id])
      @ship = Ship.find_by(id: params[:ship_id])
---
SELECT  "ships".* FROM "ships" WHERE "ships"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]