app/controllers/fleets_controller.rb

  def create
    @fleet = Fleet.new(fleet_params)
    @user.fleets << @fleet
      if @fleet.save
---
INSERT INTO "fleets" ("name", "league_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New Fleet"], ["league_id", 3], ["user_id", 1], ["created_at", "2019-02-28 23:24:08.091369"], ["updated_at", "2019-02-28 23:24:08.091369"]]
INSERT INTO "fleets" ("name", "league_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "New Fleet 2"], ["league_id", 1], ["user_id", 2], ["created_at", "2019-02-28 00:32:35.735641"], ["updated_at", "2019-02-28 00:32:35.735641"]]

  def update
    @fleet.update(fleet_params)
---
UPDATE "fleets" SET "name" = ?, "updated_at" = ? WHERE "fleets"."id" = ?  [["name", "fjlakdsfjaskf"], ["updated_at", "2019-02-28 23:10:19.116214"], ["id", 1]]