app/controllers/leagues_controller.rb

SELECT "leagues".* FROM "leagues"
---
  def index
    @leagues = League.all

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @league = League.find(params[:id])

INSERT INTO "leagues" ("name", "num_of_fleets", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Create New League"], ["num_of_fleets", 10], ["admin_id", 1], ["created_at", "2019-02-28 23:24:00.789467"], ["updated_at", "2019-02-28 23:24:00.789467"]]
---
  def create
    @league = League.new(league_params)
    @league.admin_id = @user.id
      if @league.save

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "leagues" WHERE "leagues"."id" = ?  [["id", 1]]
---
  def destroy
    @league = League.find(params[:id])
    binding.pry
    if @league.admin_id == @user.id
      @league.destroy