app/controllers/sessions_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "image", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "10212994570009568"], ["LIMIT", 1]]
---
  def fbcreate
    @user = User.find_or_create_by(uid: auth['uid']) do |u|