app/controllers/ships_controller.rb

SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    if params[:fleet_id] && Fleet.exists?(params[:fleet_id])
      @fleet = Fleet.find(params[:fleet_id])