app/controllers/ships_controller.rb

SELECT "ships".* FROM "ships" ORDER BY ships.max_cargo DESC
---
  def index
    if params[:order_by]
      @ships = Ship.cargo_weight
    else
      @ships = Ship.all

SELECT "voyages".* FROM "voyages" WHERE (fleet_id = 4 AND ship_id = 1) AND NOT (("voyages"."dep_port" = ? OR "voyages"."dep_port" IS NULL))  [["dep_port", ""]]
---
  def show
    if @fleet
      @voyages = Voyage.all.where("fleet_id = ? AND ship_id = ?", @fleet.id, @ship.id).where.not(dep_port: [nil, ""])

INSERT INTO "ships" ("name", "size", "max_cargo", "max_distance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "New Ship"], ["size", "Neopanamax"], ["max_cargo", 2000], ["max_distance", 2000], ["created_at", "2019-02-28 02:55:28.289749"], ["updated_at", "2019-02-28 02:55:28.289749"]]
INSERT INTO "fleet_ships" ("fleet_id", "ship_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["fleet_id", 1], ["ship_id", 3], ["created_at", "2019-02-28 03:08:41.160167"], ["updated_at", "2019-02-28 03:08:41.160167"]]
---
  def update
    if edit_permission_check
      @fleet.ships << @ship

SELECT "fleets".* FROM "fleets"
SELECT  "fleets".* FROM "fleets" WHERE "fleets"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new
    if params[:fleet_id] && Fleet.exists?(params[:fleet_id])
      @fleet = Fleet.find(params[:fleet_id])

INSERT INTO "ships" ("name", "size", "max_cargo", "max_distance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "New Ship"], ["size", "Handy Size"], ["max_cargo", 1000], ["max_distance", 500], ["created_at", "2019-02-28 23:22:51.418777"], ["updated_at", "2019-02-28 23:22:51.418777"]]
---
  def create
    @ship = Ship.new(ship_params)
      if @ship.save

DELETE FROM "fleet_ships" WHERE "fleet_ships"."fleet_id" = ? AND "fleet_ships"."ship_id" = ?  [["fleet_id", 1], ["ship_id", 1]]
---
  def destroy

    if edit_permission_check
      @fleet.ships.delete(@ship)

SELECT  1 AS one FROM "fleets" WHERE "fleets"."user_id" = ? AND "fleets"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def edit_permission_check
    @fleet && @ship && @user.fleets.include?(@fleet)