app/controllers/voyages_controller.rb

INSERT INTO "voyages" ("dep_port", "arr_port", "distance", "cargo", "fleet_id", "ship_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["dep_port", ""], ["arr_port", ""], ["distance", 500], ["cargo", 1000], ["fleet_id", 1], ["ship_id", 4], ["created_at", "2019-02-28 21:30:33.353868"], ["updated_at", "2019-02-28 21:30:33.353868"]]
---
  def create
    @voyage = Voyage.new(voyage_params)
      if @voyage.save