app/models/fleet.rb

SELECT "ships".* FROM "ships" INNER JOIN "voyages" ON "ships"."id" = "voyages"."ship_id" WHERE "voyages"."fleet_id" = ?  [["fleet_id", 1]]
---
  def points
    self.ships.sum {|ship| ship.points(self)}