app/models/league.rb

  def full?
    self.fleets.count >= self.num_of_fleets
---
SELECT COUNT(*) FROM "fleets" WHERE "fleets"."league_id" = ?  [["league_id", 4]]