app/models/ship.rb

SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "ships".* FROM "ships" INNER JOIN "voyages" ON "ships"."id" = "voyages"."ship_id" WHERE "voyages"."fleet_id" = ? AND "ships"."size" = ? LIMIT ?  [["fleet_id", 7], ["size", "Handymax"], ["LIMIT", 1]]
SELECT  1 AS one FROM "ships" INNER JOIN "voyages" ON "ships"."id" = "voyages"."ship_id" INNER JOIN "fleets" ON "voyages"."fleet_id" = "fleets"."id" WHERE "fleets"."league_id" = ? AND "ships"."id" = ? LIMIT ?  [["league_id", 3], ["id", 1], ["LIMIT", 1]]
---
  def available(fleet)
    !fleet.league.ships.include?(self) && !fleet.ships.find_by(size: self.size)

SELECT SUM("voyages"."distance") FROM "voyages" WHERE "voyages"."ship_id" = ? AND "voyages"."fleet_id" = ?  [["ship_id", 1], ["fleet_id", 1]]
---
  def sum_distance(fleet)
    self.voyages.where(fleet_id: fleet.id).sum("distance")

SELECT SUM("voyages"."cargo") FROM "voyages" WHERE "voyages"."ship_id" = ? AND "voyages"."fleet_id" = ?  [["ship_id", 1], ["fleet_id", 1]]
---
  def sum_cargo(fleet)
    self.voyages.where(fleet_id: fleet.id).sum("cargo")